In [3]:
# PREGUNTA 01 #
# Import the pandas library and create a DataFrame with the following data:
# a. A column called "name" containing the names "John", "Mike", and "Sara"
# b. A column called "age" containing the ages 25, 30, and 35
# c. A column called "city" containing the cities "New York", "Los Angeles", and "Chicago"
# d. Print the DataFrame to the console

import pandas as pd
dtfrm = {
       'name' : ['John', 'Mike', 'Sara'],
       'age': [ 25, 30, 35 ],
       'city' : ["New York", "Los Angeles", "Chicago"]
       }
dtfrm = pd.DataFrame(dtfrm)
dtfrm

   name  age         city
0  John   25     New York
1  Mike   30  Los Angeles
2  Sara   35      Chicago

In [16]:
# PREGUNTA 02 #
# Access the first row of the DataFrame and print it to the console

#Primer método
dtfrm.loc[0:0,:]

   name  age      city
0  John   25  New York

In [17]:
#Segundo método
dtfrm.iloc[0:1,:]

   name  age      city
0  John   25  New York

In [12]:
#Tercer método
dtfrm.loc[0,:]

name        John
age           25
city    New York
Name: 0, dtype: object

In [9]:
# PREGUNTA 03 #
# Access the "name" column of the DataFrame and print it to the console
dtfrm.loc[:,"name"]

0    John
1    Mike
2    Sara
Name: name, dtype: object